RT-Thread/rt-thread/bsp/efm32/drv_sdcard.c
/***************************************************************************//**
 * @file 	drv_sdcard.c
 * @brief 	Memory card driver (SPI mode) of RT-Thread RTOS for using EFM32 
 *  USART module
 * 	COPYRIGHT (C) 2011, RT-Thread Development Team
 * @author 	onelife
 * @version 0.4 beta
 *******************************************************************************
 * @section License
 * The license and distribution terms for this file may be found in the file 
 *  LICENSE in this distribution or at http://www.rt-thread.org/license/LICENSE
 *******************************************************************************
 * @section Change Logs
 * Date			Author		Notes
 * 2011-05-13	onelife		Initial creation for using EFM32 USART module
 * 2011-07-07	onelife		Modify initialization function to return error code
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup efm32_dk
 * @{
 ******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "board.h"
#include "drv_usart.h"
#include "drv_sdcard.h"

#if defined(EFM32_USING_SPISD)
#include <dfs_fs.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#ifdef EFM32_SDCARD_DEBUG
#define sdcard_debug(format,args...) 		rt_kprintf(format, ##args)
#else
#define sdcard_debug(format,args...)
#endif

/* Private constants ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static struct rt_device 	sd_device;
static struct dfs_partition	sdPart;
static rt_device_t 			spi 			= RT_NULL;
static rt_uint16_t 			sdType;
static rt_bool_t 			sdAutoCs 		= true;
static rt_timer_t 			sdTimer 		= RT_NULL;
static rt_bool_t 			sdInTime 		= true;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/***************************************************************************//**
 * @brief
 *   Memory device timeout interrupt handler
 *
 * @details
 *
 * @note
 *
 * @param[in] parameter
 *	Parameter
 ******************************************************************************/
static void efm_spiSd_timer(void* parameter)
{
	sdInTime = false;
}

/***************************************************************************//**
 * @brief
 *   Set/Clear chip select
 *
 * @details
 *
 * @note
 *
 * @param[in] enable
 *  Chip select pin setting
 ******************************************************************************/
static void efm_spiSd_cs(rt_uint8_t enable)
{
	if (!sdAutoCs)
	{
		if (enable)
		{
			GPIO_PinOutClear(SD_CS_PORT, SD_CS_PIN);
		}
		else
		{
			GPIO_PinOutSet(SD_CS_PORT, SD_CS_PIN);
		}
	}
}

/***************************************************************************//**
 * @brief
 *   Set operation speed level 
 *
 * @details
 *
 * @note
 *
 * @param[in] level
 *  Set SD speed level 
 ******************************************************************************/
static void efm_spiSd_speed(rt_uint8_t level)
{
	RT_ASSERT(spi != RT_NULL);

	struct efm32_usart_device_t *usart;
	rt_uint32_t baudrate;
	
	usart = (struct efm32_usart_device_t *)(spi->user_data);
	if (level == SD_SPEED_HIGH)
	{
		baudrate = EFM32_SDCLK_HIGH;
	}
	else
	{
		baudrate = EFM32_SDCLK_LOW;
	}
	USART_BaudrateSyncSet(usart->usart_device, 0, baudrate);
}

/***************************************************************************//**
 * @brief
 *   Read raw data from memory device
 *
 * @details
 *
 * @note
 *
 * @param[in] buffer
 *   Poniter to the buffer
 *
 * @param[in] size
 *   Buffer size in byte
 *
 * @return
 *   Number of read bytes
 ******************************************************************************/
static rt_size_t efm_spiSd_read(void *buffer, rt_size_t size)
{
	RT_ASSERT(spi != RT_NULL);

	rt_uint8_t buf_read[5], ret;

	/* Build instruction buffer */
	buf_read[0] = 0x00;
	*(rt_uint8_t **)(&buf_read[1]) = buffer;
	/* Read data */
	efm_spiSd_cs(1);
	if ((ret = spi->read(spi, EFM32_NO_DATA, buf_read, size)) == 0)
	{
		sdcard_debug("SPISD: Read failed!\n");
	}
	efm_spiSd_cs(0);

	return ret;
}

/***************************************************************************//**
 * @brief
 *   Send command to memory device
 *
 * @details
 *
 * @note
 *
 * @param[in] cmd
 *   Command index
 *
 * @param[in] arg
 *   Argument
 *
 * @param[in] trail
 *   Pointer to the buffer to store trailing data
 *
 * @return
 *   Command response
 ******************************************************************************/
static rt_uint16_t efm_spiSd_cmd(
	rt_uint8_t cmd, 
	rt_uint32_t arg, 
	rt_uint8_t *trail)
{
	RT_ASSERT(spi != RT_NULL);

	rt_uint8_t buf_ins[11];
	rt_uint8_t buf_res[32]; 	/* Expect (x+1+4) bytes for CRC, (x+1+19) for CSD/CID */
	rt_uint8_t len_trl, i, j;
	rt_uint16_t ret;
	rt_bool_t skip;

	ret = 0xffff; 
	rt_memset(buf_res, 0xff, sizeof(buf_res));

	sdcard_debug("SPISD: Send command %d(%x)\n", cmd, arg);
	do
	{
		/* Build instruction buffer */
		buf_ins[0] = 6; 							/* Instruction length */
		buf_ins[1] = 0x40 | cmd; 					/* Command index */
		buf_ins[2] = (arg >> 24) & 0x000000ff; 		/* Argument: MSB first */
		buf_ins[3] = (arg >> 16) & 0x000000ff;
		buf_ins[4] = (arg >> 8) & 0x000000ff;
		buf_ins[5] = arg & 0x000000ff;
		if (cmd == CMD0)
		{
			buf_ins[6] = 0x95; 						/* Valid CRC for CMD0(0) */
		}
		else if (cmd == CMD8)
		{
			buf_ins[6] = 0x87; 						/* Valid CRC for CMD8(0x1AA) */
		}
		else if (cmd == CMD58)
		{
			buf_ins[6] = 0x01; 						/* Dummy CRC + Stop */
		}
		else
		{
			buf_ins[6] = 0x01; 						/* Dummy CRC + Stop */
		}
		*(rt_uint8_t **)(&buf_ins[7]) = buf_res; 	/* Pointer to RX buffer */

		/* Set trail length */
		if (cmd == CMD8)
		{
			len_trl = 4;							/* R7 response */
		}
		else if (cmd == CMD9)
		{
			len_trl = SD_BLOCK_SIZE_CSD;
		}
		else if (cmd == CMD10)
		{
			len_trl = SD_BLOCK_SIZE_CID;
		}
		else if (cmd == CMD58)
		{
			len_trl = SD_BLOCK_SIZE_OCR;			/* R3 response */
		}
		else
		{
			len_trl = 0;
		}

		/* Send command and get response */
		efm_spiSd_cs(1);
	 	if (spi->read(spi, EFM32_NO_DATA, buf_ins, sizeof(buf_res)) == 0)
		{
			sdcard_debug("SPISD: Send command failed!\n");
			break;
		}		
		efm_spiSd_cs(0);

