RT-Thread/rt-thread/bsp/efm32/drv_sdcard.c
		/* Skip a stuff byte when stop reading */
		if (cmd == CMD12)
		{
			skip = true;
		}
		else
		{
			skip = false; 
		}
		/* Find valid response: The response is sent back within command response time 
		    (NCR), 0 to 8 bytes for SDC, 1 to 8 bytes for MMC */
		for (i = 0; i < sizeof(buf_res); i++)
		{
			if (buf_res[i] != 0xff)
			{
				if (skip)
				{
					skip = false;
					sdcard_debug("SPISD: Skip %x (at %d)\n", buf_res[i], i);
					continue;
				}

				if (cmd == ACMD13 & 0x7f)
				{
					ret = (rt_uint16_t)buf_res[i];	/* R2 response */
				}
				else
				{
					ret = (rt_uint8_t)buf_res[i];
				}
				break;
			}
		}
		sdcard_debug("SPISD: Response %x (at %d)\n", ret, i);
		i++;
		/* Copy the trailing data */
		if ((ret != 0xffff) && len_trl && trail)
		{
			if (cmd == CMD9 || cmd == CMD10)
			{
				/* Wait for data block */
				for (; i < sizeof(buf_res); i++)
				{
					if (buf_res[i] == 0xfe)
					{
						break;
					}
				}
				/* Check if valid */
				if (i >= sizeof(buf_res))
				{
					sdcard_debug("SPISD: Token is not found!\n");
					ret = 0xffff;
					break;
				}
				i++;
			}
			/* Copy the data */
			for (j = 0; j < len_trl; j++)
			{
				trail[j] = buf_res[i + j];
			}
		}
	} while(0);

	return ret;
}

/***************************************************************************//**
 * @brief
 *   Read a block of data from memory device. This function is used to handle 
 *  the responses of specified commands (e.g. ACMD13, CMD17 and CMD18)
 *
 * @details
 *
 * @note
 *
 * @param[in] buffer
 *   Poniter to the buffer
 *
 * @param[in] size
 *   Buffer size in byte
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t efm_spiSd_readBlock(void *buffer, rt_size_t size)
{
	RT_ASSERT(spi != RT_NULL);

	rt_uint8_t buf_ins[5];
	rt_uint8_t buf_res[8]; 		/* Expect 2 bytes for CRC */		
	rt_uint8_t i, len_copy;
	rt_bool_t start;

	start = false;
	do
	{
		/* Build instruction buffer */
		buf_ins[0] = 0; 							/* Instruction length */
		*(rt_uint8_t **)(&buf_ins[1]) = buf_res;	/* Pointer to RX buffer */

		while(1) 
		{
			/* Send read command */
			efm_spiSd_cs(1);
			if (spi->read(spi, EFM32_NO_DATA, buf_ins, \
				sizeof(buf_res)) == 0)
			{
				sdcard_debug("SPISD: Get read command response failed!\n");
				break;
			}
			efm_spiSd_cs(0);
			/* Wait for data */
			for (i = 0; i < sizeof(buf_res); i++)
			{
				if (buf_res[i] != 0xff)
				{
					start = true;
					break;
				}
			}
			if (start)
			{
				break;
			}
		};

		/* Ckeck if valid */
		if (!start || (buf_res[i] != 0xfe))
		{
			sdcard_debug("SPISD: Token is invalid! (%x)\n", buf_res[i]);
			break;
		}
		/* Copy data to buffer and read the rest */
		len_copy = sizeof(buf_res) - i - 1;
		rt_memcpy(buffer, &buf_res[i + 1], len_copy);
		sdcard_debug("SPISD: Read block start at %d, copy %d bytes\n", i, \
			len_copy);
	
		/* Build instruction buffer */
		buf_ins[0] = 0; 							/* Instruction length */
		*(rt_uint8_t **)(&buf_ins[1]) = (rt_uint8_t *)buffer + len_copy; 	/* Pointer to RX buffer */

		/* Send read command */
		efm_spiSd_cs(1);
		if (spi->read(spi, EFM32_NO_DATA, buf_ins, size - len_copy) == 0)
		{
			sdcard_debug("SPISD: Read data block failed!\n");
			break;
		}
		*(rt_uint8_t **)(&buf_ins[1]) = buf_res; 	/* Pointer to RX buffer */
		if (spi->read(spi, EFM32_NO_DATA, buf_ins, sizeof(buf_res)) == 0)
		{
			sdcard_debug("SPISD: Read CRC failed!\n");
			break;
		}
		sdcard_debug("SPISD: Read CRC %x %x\n", buf_res[0], buf_res[1]);
		efm_spiSd_cs(0);

		return RT_EOK;
	} while(0);

	sdcard_debug("SPISD: Read block failed!\n");
	return -RT_ERROR;
}

/***************************************************************************//**
 * @brief
 *   Write a block of data to memory device. This function is used to send data 
 *  and control tokens for block write commands (e.g. CMD24 and CMD25) 
 *
 * @details
 *
 * @note
 *
 * @param[in] buffer
 *   Poniter to the buffer
 *
 * @param[in] token
 *   Control token
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t efm_spiSd_writeBlock(void *buffer, rt_uint8_t token)
{
	RT_ASSERT(spi != RT_NULL);

	rt_err_t ret;
	rt_uint8_t buf_ins[11];
	rt_uint8_t buf_res[8]; 		/* Expect a byte for data response */
	rt_uint8_t i;

	ret = RT_ERROR;
	do
	{
		/* Initialize timer */
		sdInTime = true;
		rt_timer_start(sdTimer);
		/* Wait for card ready */
		do
		{
			efm_spiSd_read(buf_res, sizeof(buf_res));
		} while (sdInTime && (buf_res[sizeof(buf_res) - 1] != 0xff));
		if (buf_res[sizeof(buf_res) - 1] != 0xff)
		{
			sdcard_debug("SPISD: Card is busy before writing! (%x)\n", \
				buf_res[sizeof(buf_res) - 1]);
			ret = -RT_EBUSY;
			break;
		}
		rt_timer_stop(sdTimer);

		/* Send token */
		buf_ins[0] = token;
		efm_spiSd_cs(1);
		if (spi->write(spi, EFM32_NO_DATA, buf_ins, 1) == 0)
		{
			sdcard_debug("SPISD: Write token failed!\n");
			break;
		}
		/* Send data */
		if (token != 0xfd)
		{
			if (spi->write(spi, EFM32_NO_DATA, buffer, SD_SECTOR_SIZE) == 0)
			{
				sdcard_debug("SPISD: Write data failed!\n");
				break;
			}

			/* Build instruction buffer */
			buf_ins[0] = 2; 							/* Instruction length */
			buf_ins[1] = 0xff; 							/* CRC (Dummy) */
			buf_ins[2] = 0xff;
			*(rt_uint8_t **)(&buf_ins[3]) = buf_res; 	/* Pointer to RX buffer */
			/* Send CRC and read a byte */
			if (spi->read(spi, EFM32_NO_DATA, buf_ins, sizeof(buf_res)) == 0)
			{
				sdcard_debug("SPISD: Write CRC failed!\n");
				break;
			}
			efm_spiSd_cs(0);

			/* Check if accepted */
			for (i = 0; i < sizeof(buf_res); i++)
			{
				if (buf_res[i] != 0xff)
				{
					buf_res[i] &= 0x1f;
					break;
				}
			}
			if (buf_res[i] != 0x05)
			{
				sdcard_debug("SPISD: Writing is not accepted! (%x at %d)\n", \
					buf_res[i], i);
				break;
			}
		}
		else
		{
			/* Initialize timer */
			sdInTime = true;
			rt_timer_start(sdTimer);
			/* Wait for card ready */
			do
			{
				efm_spiSd_read(buf_res, sizeof(buf_res));
			} while (sdInTime && (buf_res[sizeof(buf_res) - 1] != 0xff));
			if (buf_res[sizeof(buf_res) - 1] != 0xff)
			{
				sdcard_debug("SPISD: Card is busy after writing! (%x)\n", \
					buf_res[sizeof(buf_res) - 1] );
				ret = -RT_EBUSY;
				break;
			}
			rt_timer_stop(sdTimer);
		}

