RT-Thread/rt-thread/bsp/efm32/drv_sdcard.c
		return RT_EOK;
	} while(0);

	sdcard_debug("SPISD: Write block failed!\n");
	return ret;
}

/***************************************************************************//**
 * @brief
 *   Wrapper function of send command to memory device
 *
 * @details
 *
 * @note
 *
 * @param[in] cmd
 *   Command index
 *
 * @param[in] arg
 *   Argument
 *
 * @param[in] trail
 *   Pointer to the buffer to store trailing data
 *
 * @return
 *   Command response
 ******************************************************************************/
rt_uint16_t efm_spiSd_sendCmd(
	rt_uint8_t cmd, 
	rt_uint32_t arg, 
	rt_uint8_t *trail)
{
	rt_uint16_t ret;

	/* ACMD<n> is the command sequense of CMD55-CMD<n> */
	if (cmd & 0x80)
	{
		cmd &= 0x7f;
		ret = efm_spiSd_cmd(CMD55, 0x00000000, EFM32_NO_POINTER);
		if (ret > 0x01) 
		{
			return ret;
		}
	}

	return efm_spiSd_cmd(cmd, arg, trail);
}

/***************************************************************************//**
 * @brief
 *   Initialize memory card device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t rt_spiSd_init(rt_device_t dev)
{
	RT_ASSERT(spi != RT_NULL);

	rt_uint8_t type, cmd, tril[4];
	rt_uint8_t *buf_res;

	type = 0;
	buf_res = RT_NULL;

	do
	{
		/* Create and setup timer */
		if ((sdTimer = rt_timer_create(
			"sdTimer",
			efm_spiSd_timer,
			RT_NULL,
			SD_WAIT_PERIOD, 
			RT_TIMER_FLAG_ONE_SHOT)) == RT_NULL)
		{
			sdcard_debug("SPISD: Create timer failed!\n");
			break;
		}

		/* Open SPI device */
		if (spi->open(spi, RT_DEVICE_OFLAG_RDWR) != RT_EOK)
		{
			break;
		}

		/* Switch to low speed */
		efm_spiSd_speed(SD_SPEED_LOW);		

		/* 80 dummy clocks */
		efm_spiSd_read(RT_NULL, 80);
		/* Enter Idle state */
		if (efm_spiSd_sendCmd(CMD0, 0x00000000, EFM32_NO_POINTER) != 0x01)
		{
			break;
		}
		/* Check if SDv2 */
		if (efm_spiSd_sendCmd(CMD8, 0x000001AA, tril) == 0x01)
		{
			/* SDv2, Vdd: 2.7-3.6V */
			if (tril[2] == 0x01 && tril[3] == 0xAA) 
			{
				/* Initialize timer */
				sdInTime = true;
				rt_timer_start(sdTimer);
				/* Wait for leaving idle state (ACMD41 with HCS bit) */
				while (efm_spiSd_sendCmd(ACMD41, 0x40000000, EFM32_NO_POINTER) \
					&& sdInTime);
				/* Check CCS bit (bit 30) in the OCR */
				if (sdInTime && efm_spiSd_sendCmd(CMD58, 0x00000000, tril) \
					== 0x00)
				{
					type = (tril[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
				}
			}
		}
		else
		{
			if (efm_spiSd_sendCmd(ACMD41, 0x00000000, EFM32_NO_POINTER) <= 0x01)
			{
				/* SDv1 */
				type = CT_SD1;
				cmd = ACMD41;	
			}
			else
			{
				/* MMCv3 */
				type = CT_MMC;
				cmd = CMD1;
			}
			/* Initialize timer */
			sdInTime = true;
			rt_timer_start(sdTimer);
			/* Wait for leaving idle state */
			while (efm_spiSd_sendCmd(cmd, 0x00000000, EFM32_NO_POINTER) && \
				sdInTime);
			/* Set read/write block length to SD_BLOCK_SIZE */
			if (!sdInTime || \
				(efm_spiSd_sendCmd(CMD16, SD_SECTOR_SIZE, EFM32_NO_POINTER) \
				!= 0x00))
			{
				type = 0;
				break;
			}
		}
		rt_timer_stop(sdTimer);

		/* Check type */
		sdType = type;
		if (sdType) 
		{
			/* Initialization succeded */
			efm_spiSd_speed(SD_SPEED_HIGH);
		}
		else
		{
			break;
		}

		/* Allocate buffer */
		if ((buf_res = rt_malloc(SD_SECTOR_SIZE)) == RT_NULL)
		{
			sdcard_debug("SPISD: No memory for sector buffer\n");
			break;
		}
		/* Read the first sector for partition table */
		if (dev->read(dev, 0, buf_res, 1) != 1)
		{
			sdcard_debug("SPISD: Read first sector failed!\n");
			break;
		}
		/* Fetch the partition table */
		if (dfs_filesystem_get_partition(&sdPart, buf_res, 0) != RT_EOK)
		{
			sdPart.offset = 0;
			sdPart.size = 0;
			sdcard_debug("SPISD: No partition table\n");
		}
		/* Release buffer */
		rt_free(buf_res);
		sdcard_debug("SPISD: Init OK, card type %x\n", sdType);
		return RT_EOK;
	} while (0);

	/* Release buffer */
	if (buf_res)
	{
		rt_free(buf_res);
	}	
	efm_spiSd_deinit();
	rt_kprintf("SPISD: Init failed!\n");
	return -RT_ERROR;
}

/***************************************************************************//**
 * @brief
 *   Open memory card device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] oflag
 *   Device open flag
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t rt_spiSd_open(rt_device_t dev, rt_uint16_t oflag)
{
	sdcard_debug("SPISD: Open, flag %x\n", sd_device.flag);
	return RT_EOK;
}

/***************************************************************************//**
 * @brief
 *   Close memory card device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t rt_spiSd_close(rt_device_t dev)
{
	sdcard_debug("SPISD: Close, flag %x\n", sd_device.flag);
	return RT_EOK;
}

/***************************************************************************//**
 * @brief
 *   Read from memory card device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] sector
 *   Start sector number (LBA)
 *
 * @param[in] buffer
 *   Pointer to the buffer
 *
 * @param[in] count
 *   Sector count (1..255)
 *
 * @return
 *   Number of read sectors
 ******************************************************************************/
static rt_size_t rt_spiSd_read(
	rt_device_t 	dev, 
	rt_off_t 		sector,
	void 			*buffer,
	rt_size_t 		count)
{
	rt_uint8_t buf_ins[11], buf_res[12];
	rt_uint8_t *ptr;
	rt_uint8_t cmd, i;
	rt_size_t cnt;

	ptr = (rt_uint8_t *)buffer;
	cnt = count;

	sdcard_debug("SPISD: ****** Read Data ******\n");
	if (!(sdType & CT_BLOCK))
	{
		/* Convert to byte address if needed */
		sector *= SD_SECTOR_SIZE;
	}

	do
	{
		if (cnt == 1)
		{
			/* Single block read */
			cmd = CMD17;
			sdcard_debug("SPISD: Read single block\n");
		}
		else
		{
			/* Multiple block read */
			cmd = CMD18;
			sdcard_debug("SPISD: Read multiple blocks\n");
		}

		if (efm_spiSd_sendCmd(cmd, sector, EFM32_NO_POINTER))
		{
			sdcard_debug("SPISD: Read command error!\n");
			break;
		}
	
		/* Read data */
		do
		{
			if (efm_spiSd_readBlock(ptr, SD_SECTOR_SIZE))
			{
				break;
			}
			ptr += SD_SECTOR_SIZE;
		} while(--cnt);

		/* Stop transmission */
		if (cmd == CMD18)
		{
			if (efm_spiSd_sendCmd(CMD12, 0x00000000, EFM32_NO_POINTER))
			{
				break;
			}
		}

		return (count);
	} while(0);

	return (0);
}

/***************************************************************************//**
 * @brief
 *   Write to memory card device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] sector
 *   Start sector number (LBA)
 *
 * @param[in] buffer
 *   Pointer to the buffer
 *
 * @param[in] count
 *   Sector count (1..255)
 *
 * @return
 *   Number of written sectors
 ******************************************************************************/
static rt_size_t rt_spiSd_write (
	rt_device_t 	dev, 
	rt_off_t 		sector,
	const void 		*buffer,
	rt_size_t 		count)
{
	rt_uint8_t buf_ins[11], buf_res[12];
	rt_uint8_t *ptr;
	rt_uint8_t cmd, token, i;
	rt_size_t cnt;

	ptr = (rt_uint8_t *)buffer;
	cnt = count;

	sdcard_debug("SPISD: ****** Write Data ******\n");
	if (!(sdType & CT_BLOCK))
	{
		/* Convert to byte address if needed */
		sector *= SD_SECTOR_SIZE;
	}

	do
	{
		if (cnt == 1)
		{
			/* Single block write */
			cmd = CMD24;
			token = 0xfe;
			sdcard_debug("SPISD: Write single block\n");
		}
		else
		{
			/* Multiple block write */
			cmd = CMD25;
			token = 0xfc;
			sdcard_debug("SPISD: Write multiple blocks\n");
			if (sdType & CT_SDC) 
			{
				if (efm_spiSd_sendCmd(ACMD23, count, EFM32_NO_POINTER))
				{
					break;
				}
			}
		}

		if (efm_spiSd_sendCmd(cmd, sector, EFM32_NO_POINTER))
		{
			sdcard_debug("SPISD: Write command error!\n");
			break;
		}

		/* Write data */
		do
		{
			if (efm_spiSd_writeBlock(ptr, token))
			{
				break;
			}
			ptr += SD_SECTOR_SIZE;
		} while(--cnt);

		/* Stop transmission token */
		if (efm_spiSd_writeBlock(EFM32_NO_POINTER, 0xfd))
		{
			break;
		}

		return (count);
	} while(0);

	return (0);
}

/***************************************************************************//**
* @brief
*   Configure memory card device
*
* @details
*
* @note
*
* @param[in] dev
*   Pointer to device descriptor
*
* @param[in] ctrl
*   Memory card control command
*
* @param[in] buffer
*   Pointer to the buffer of in/out data
*
* @return
*   Error code
******************************************************************************/
static rt_err_t rt_spiSd_control (
	rt_device_t 	dev, 
	rt_uint8_t 		ctrl, 
	void 			*buffer)
{
	rt_err_t ret;
	rt_uint32_t c_size;
	rt_uint8_t n;
	rt_uint8_t *buf_res;
	
	ret = -RT_ERROR;
	buf_res = RT_NULL;
	switch (ctrl)
	{
	case RT_DEVICE_CTRL_SD_SYNC:
		/* Flush dirty buffer if present */
		efm_spiSd_cs(1);
		efm_spiSd_cs(0);
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_SCOUNT:
		{
			/* Allocate buffer */
			if ((buf_res = rt_malloc(SD_BLOCK_SIZE_CSD)) == RT_NULL)
			{
				sdcard_debug("SPISD: No memory for RX buffer\n");
				break;
			}
			/* Get number of sectors on the disk (32 bits) */
			if (efm_spiSd_sendCmd(CMD9, 0x00000000, buf_res))
			{
				sdcard_debug("SPISD: Get CSD failed!\n");
				break;
			}

			if ((buf_res[0] >> 6) == 0x01)
			{	
				/* SDv2 */
				/* C_SIZE: Bit 48~69 */
				c_size = ((rt_uint32_t)(buf_res[7] & 0x3f) << 16) + \
					((rt_uint32_t)buf_res[8] << 8) + buf_res[9] + 1;
				/* Result = Capacity / Sector Size */
				*(rt_uint32_t *)buffer = (rt_uint32_t)c_size << \
					(19 - SD_SECTOR_SIZE_SHIFT);
			}
			else
			{
				/* SDv1 or MMC */
				/* C_SIZE: Bit 62~73 */
				c_size = ((rt_uint32_t)(buf_res[6] & 0x03) << 10) + \
					((rt_uint16_t)buf_res[7] << 2) + (buf_res[8] >> 6) + 1;
				/* READ_BL_LEN: Bit 80~83, C_SIZE_MULT: Bit 47~49 */
				n = ((buf_res[9] & 0x03) << 1) + ((buf_res[10] & 0x80) >> 7) + \
					2 + (buf_res[5] & 0x0f);
				/* Result = Capacity / Sector Size */
				*(rt_uint32_t *)buffer = (rt_uint32_t)c_size << \
					(n - SD_SECTOR_SIZE_SHIFT);
			}
			ret = RT_EOK;
			break;
		}

	case RT_DEVICE_CTRL_SD_GET_SSIZE:
		/* Get sectors on the disk (16 bits) */
		*(rt_uint16_t *)buffer = SD_SECTOR_SIZE;
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_BSIZE:
		/* Get erase block size in unit of sectors (32 bits) */
		if (sdType & CT_SD2)
		{
			/* Allocate buffer */
			if ((buf_res = rt_malloc(SD_BLOCK_SIZE_SDSTAT)) == RT_NULL)
			{
				sdcard_debug("SPISD: No memory for RX buffer\n");
				break;
			}
			/* SDv2 */
			if (efm_spiSd_sendCmd(ACMD13, 0x00000000, EFM32_NO_POINTER))
			{
				sdcard_debug("SPISD: Get SD status failed!\n");
				break;
			}
			if (efm_spiSd_readBlock(buf_res, SD_BLOCK_SIZE_SDSTAT))
			{
				sdcard_debug("SPISD: Read SD status failed!\n");
				break;
			}
			/* AU_SIZE: Bit 428~431 */
			*(rt_uint32_t *)buffer = 16UL << ((buf_res[10] >> 4) + 9 - \
				SD_SECTOR_SIZE_SHIFT);
		}
		else
		{
			/* Allocate buffer */
			if ((buf_res = rt_malloc(SD_BLOCK_SIZE_CSD)) == RT_NULL)
			{
				sdcard_debug("SPISD: No memory for RX buffer\n");
				break;
			}
			/* SDv1 or MMC */
			if (efm_spiSd_sendCmd(CMD9, 0x00000000, buf_res))
			{
				sdcard_debug("SPISD: Get CSD failed!\n");
				break;
			}

			if (sdType & CT_SD1)
			{
				/* SECTOR_SIZE: Bit 39~45, WRITE_BL_LEN: Bit 22~25 (9, 10 or 11) */
				*(rt_uint32_t *)buffer = (((buf_res[10] & 0x3f) << 1) + \
					((rt_uint32_t)(buf_res[11] & 0x80) >> 7) + 1) << \
					(8 + (buf_res[13] >> 6) - SD_SECTOR_SIZE_SHIFT);
			}
			else
			{
 				/* ERASE_GRP_SIZE: Bit 42~46, ERASE_GRP_MULT: Bit 37~41 */
				*(rt_uint32_t *)buffer = \
					((rt_uint16_t)((buf_res[10] & 0x7c) >> 2) + 1) * \
					(((buf_res[10] & 0x03) << 3) + \
					((buf_res[11] & 0xe0) >> 5) + 1);
			}
		}
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_TYPE:
		/* Get card type flags (1 byte) */
		*(rt_uint8_t *)buffer = sdType;
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_CSD:
		/* Receive CSD as a data block (16 bytes) */
		if (efm_spiSd_sendCmd(CMD9, 0x00000000, buffer))
		{
			sdcard_debug("SPISD: Get CSD failed!\n");
			break;
		}
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_CID:
		/* Receive CID as a data block (16 bytes) */
		if (efm_spiSd_sendCmd(CMD10, 0x00000000, buffer))
		{
			sdcard_debug("SPISD: Get CID failed!\n");
			break;
		}
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_OCR:
		/* Receive OCR as an R3 resp (4 bytes) */
		if (efm_spiSd_sendCmd(CMD58, 0x00000000, buffer))
		{
			sdcard_debug("SPISD: Get OCR failed!\n");
			break;
		}
		ret = RT_EOK;
		break;

	case RT_DEVICE_CTRL_SD_GET_SDSTAT:
		/* Receive SD statsu as a data block (64 bytes) */
		if (efm_spiSd_sendCmd(ACMD13, 0x00000000, buffer))
		{
			sdcard_debug("SPISD: Get SD status failed!\n");
			break;
		}
		if (efm_spiSd_readBlock(buffer, SD_BLOCK_SIZE_SDSTAT))
		{
			sdcard_debug("SPISD: Read SD status failed!\n");
			break;
		}
		ret = RT_EOK;
		break;

	default:
		break;
	}

