RT-Thread/rt-thread/bsp/efm32/drv_sdcard.c
	if (buf_res)
	{
		rt_free(buf_res);
	}
	return ret;
}

/***************************************************************************//**
* @brief
*	Initialize all memory card related hardware and register the device to 
*  kernel
*
* @details
*
* @note
*
* @return
*	Error code
******************************************************************************/
rt_err_t efm_spiSd_init(void)
{
	struct efm32_usart_device_t *usart;

#if defined(EFM32_G290_DK)
	/* Enable SPI access to MicroSD card */
	DVK_writeRegister(BC_SPI_CFG, 1);
#endif

	do
	{
		/* Find SPI device */
		spi = rt_device_find(SPISD_USING_DEVICE_NAME);
		if (spi == RT_NULL)
		{
			sdcard_debug("SPISD: Can't find device %s!\n", 
				SPISD_USING_DEVICE_NAME);
			break;
		}
		sdcard_debug("SPISD: Find device %s\n", SPISD_USING_DEVICE_NAME);

		/* Config chip slect pin */
		usart = (struct efm32_usart_device_t *)(spi->user_data);
		if (!(usart->state & USART_STATE_AUTOCS))
		{
			GPIO_PinModeSet(SD_CS_PORT, SD_CS_PIN, gpioModePushPull, 1);
			sdAutoCs = false;
		}

		/* Register SPI SD device */
		sd_device.init 		= rt_spiSd_init;
		sd_device.open 		= rt_spiSd_open;
		sd_device.close 	= rt_spiSd_close;
		sd_device.read 		= rt_spiSd_read;
		sd_device.write 	= rt_spiSd_write;
		sd_device.control 	= rt_spiSd_control;
		sd_device.user_data	= RT_NULL;
		rt_device_register(
			&sd_device, 
			SPISD_DEVICE_NAME, 
			RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_REMOVABLE | RT_DEVICE_FLAG_STANDALONE);

		sdcard_debug("SPISD: HW init OK, card type %x\n", sdType);
		return RT_EOK;
	} while (0);

	/* Release buffer */
	rt_kprintf("SPISD: HW init failed!\n");
	return -RT_ERROR;
}

/***************************************************************************//**
 * @brief
 *   De-initialize memory card device
 *
 * @details
 *
 * @note
 ******************************************************************************/
void efm_spiSd_deinit(void)
{
	/* Close SPI device */
	if (spi != RT_NULL)
	{
		spi->close(spi);
		spi = RT_NULL;
		sdcard_debug("SPISD: Close device %s\n", SPISD_USING_DEVICE_NAME);
	}
	/* Delete timer */
	if (sdTimer != RT_NULL)
	{
		rt_timer_delete(sdTimer);
		sdTimer = RT_NULL;
		sdcard_debug("SPISD: Delete timer\n");
	}

	sdcard_debug("SPISD: Deinit OK\n");
}

/*******************************************************************************
 * 	Export to FINSH
 ******************************************************************************/
#ifdef RT_USING_FINSH
#include <finsh.h>

void list_sd(void)
{
	rt_uint8_t buf_res[16];
	rt_uint32_t capacity, temp32;
	rt_uint16_t temp16;

	rt_kprintf("    SD Card on %s\n", SPISD_USING_DEVICE_NAME);
	rt_kprintf(" ------------------------------\n");
	sd_device.control(&sd_device, RT_DEVICE_CTRL_SD_GET_CID, buf_res);
	rt_kprintf(" Manufacturer ID:\t%x\n", buf_res[0]);
	rt_kprintf(" OEM/Application ID:\t%x%x\n", buf_res[1], buf_res[2]);
	rt_kprintf(" Product revision:\t%x\n", buf_res[8]);
	buf_res[8] = 0;
	rt_kprintf(" Product name:\t\t%s\n", &buf_res[3]);
	rt_kprintf(" Serial number:\t\t%x%x%x%x\n", \
		buf_res[9], buf_res[10], buf_res[11], buf_res[12]);
	rt_kprintf(" Manufacturing date:\t%d.%d\n", \
		2000 + ((buf_res[13] & 0x0F) << 4) + ((buf_res[14] & 0xF0) >> 4), \
		buf_res[14] & 0x0F);
	rt_kprintf(" Card type:\t\t");
	sd_device.control(&sd_device, RT_DEVICE_CTRL_SD_GET_TYPE, buf_res);
	if (buf_res[0] == CT_MMC)
	{
		rt_kprintf("%s\n", "MMC");
	}
	else if (buf_res[0] == CT_SDC)
	{
		rt_kprintf("%s\n", "SDXC");
	}
	else if (buf_res[0] == CT_SD1)
	{
		rt_kprintf("%s\n", "SDSC");
	}
	else if (buf_res[0] == CT_SD2)
	{
		rt_kprintf("%s\n", "SDHC");
	}
	sd_device.control(&sd_device, RT_DEVICE_CTRL_SD_GET_SSIZE, &temp16);
	sd_device.control(&sd_device, RT_DEVICE_CTRL_SD_GET_SCOUNT, &temp32);
	capacity = ((temp32 & 0x0000FFFF) * temp16) >> 16;
	capacity += ((temp32 >> 16) * temp16);
	capacity >>= 4;
	rt_kprintf(" Card capacity:\t\t%dMB\n", capacity);
}
FINSH_FUNCTION_EXPORT(list_sd, list the SD card.)
#endif

#endif /* defined(EFM32_USING_SPISD) */
/***************************************************************************//**
 * @}
 ******************************************************************************/
